In [1]:
import pandas as pd

In [2]:
adf = pd.read_csv('../data/LFS-1997-100%-Data.csv')

/home/asitha/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3057: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
adf.head()

,YEAR,MONTH,SECTOR,DISTRICT,PSU_NO,HH_NO,BLANK,RES_1,RES_2,RES_3,...,Q36_AVAILABLE_FOR_WORK,Q37_LOOKING_FOR_WORK_IN_EACH,Q38_THIS_PERSON_WAS,Q39_MAIN_OCCUPATION,Q40A_MULTIPLY_WAGE_DAYS_WORKED,Q40B_ANY_PAYMENTS_IN_KIND,Q41_EMPLOYER_THE_SECONDARY_ACTIV,Q42A_EARNING_FROM_SECOND_JOB,Q42B_ANY_PAYMENTS_IN_KIND,INFLATION_FACTOR
0,1997,1,1,1,37,1,1,1,,,...,,,1,1,8000,1,2,,,237.8926
1,1997,1,1,1,37,1,2,1,,,...,2,,3,2,,,2,,,237.8926
2,1997,1,1,1,37,1,3,1,,,...,2,,3,2,,,2,,,237.8926
3,1997,1,1,1,37,1,4,1,,,...,2,,3,2,,,2,,,237.8926
4,1997,1,1,1,37,1,5,1,,,...,,,,,,,,,,237.8926

In [4]:
feature_arrs = []
response_arrs = []

In [5]:
age_arr = list(adf.P5_AGE)
year_arr = list(adf.YEAR)
district_arr = list(adf.DISTRICT)
gender_arr = list(adf.P4_SEX)
inflation_factor = list(adf.INFLATION_FACTOR)
employeeness_arr = list(adf.Q38_THIS_PERSON_WAS)

In [6]:
for i in range(len(age_arr)):
    age_val = age_arr[i]
    year_val = year_arr[i]
    district_val = district_arr[i]
    gender_val = gender_arr[i]
    age_cat_val = 1
    if(age_val>60):
        age_cat_val = 3
    elif(age_val>15):
        age_cat_val = 2
    else:
        age_cat_val = 1
   
    count_val = inflation_factor[i]

    feature_arr = [year_val, district_val, age_cat_val, gender_val]
    response_arr = count_val
    
    if(str(employeeness_arr[i])=='1'):
        if(feature_arr not in feature_arrs):
            feature_arrs.append(feature_arr)
            response_arrs.append(response_arr)
        else:
            feature_arr_index = feature_arrs.index(feature_arr)
            old_count_val = response_arrs[feature_arr_index]
            new_count_val = old_count_val + count_val
            response_arr = new_count_val
            response_arrs[feature_arr_index] = response_arr

# print(feature_arrs)
# print(response_arrs)

In [7]:
new_unddf = pd.DataFrame(feature_arrs, columns = ['YEAR', 'DISTRICT', 'AGE_CAT', 'GENDER'])

In [8]:
new_unddf['COUNT'] = response_arrs

In [9]:
new_unddf.head()

   YEAR  DISTRICT  AGE_CAT  GENDER        COUNT
0  1997         1        2       1  480355.5025
1  1997         1        2       2  189697.1064
2  1997         1        3       2    4137.0015
3  1997         1        3       1   15472.2717
4  1997         1        1       1    1639.3907

In [10]:
new_unddf.to_csv('../data/under_employee_1997.csv', index=False)